perf/test_results/gunicorn/heavyTest.txt
> perf@1.0.0 artillery /home/fabrizio/Escritorio/Arq soft/2c20-tp-1/perf
> artillery "run" "heavyTest.yaml" "-e" "gunicorn"

Started phase 0 (PlainZero1), duration: 10s @ 12:08:47(-0300) 2020-11-08
Report @ 12:08:57(-0300) 2020-11-08
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Plain), duration: 300s @ 12:08:57(-0300) 2020-11-08
Report @ 12:09:07(-0300) 2020-11-08
Elapsed time: 20 seconds
  Scenarios launched:  19
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 2.01
  Response time (msec):
    min: 4134.7
    max: 8657.6
    median: 6396.2
    p95: 8657.6
    p99: 8657.6
  Codes:
    200: 2

Report @ 12:09:17(-0300) 2020-11-08
Elapsed time: 30 seconds
  Scenarios launched:  20
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 2.01
  Response time (msec):
    min: 13160.3
    max: 17660.3
    median: 15410.3
    p95: 17660.3
    p99: 17660.3
  Codes:
    200: 2

Report @ 12:09:27(-0300) 2020-11-08
Elapsed time: 40 seconds
  Scenarios launched:  20
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 2.01
  Response time (msec):
    min: 22160.6
    max: 26660.4
    median: 24410.5
    p95: 26660.4
    p99: 26660.4
  Codes:
    200: 2

Report @ 12:09:37(-0300) 2020-11-08
Elapsed time: 50 seconds
  Scenarios launched:  20
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 2.01
  Response time (msec):
    min: 31160.5
    max: 35660.6
    median: 33410.5
    p95: 35660.6
    p99: 35660.6
  Codes:
    200: 2

Report @ 12:09:47(-0300) 2020-11-08
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  20
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 2.01
  Response time (msec):
    min: 40160.6
    max: 44660.4
    median: 42410.5
    p95: 44660.4
    p99: 44660.4
  Codes:
    200: 2

Report @ 12:09:57(-0300) 2020-11-08
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  20
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 2.01
  Response time (msec):
    min: 49160.3
    max: 53660.5
    median: 51410.4
    p95: 53660.5
    p99: 53660.5
  Codes:
    200: 2

Report @ 12:10:07(-0300) 2020-11-08
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  20
  Scenarios completed: 7
  Requests completed:  7
  Mean response/sec: 2.01
  Response time (msec):
    min: 58160.6
    max: 60004.7
    median: 60001.3
    p95: 60004.7
    p99: 60004.7
  Codes:
    200: 1
    504: 6

Report @ 12:10:17(-0300) 2020-11-08
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 60001.4
    max: 60040.7
    median: 60001.6
    p95: 60022.8
    p99: 60040.7
  Codes:
    504: 20

Report @ 12:10:27(-0300) 2020-11-08
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.2
    max: 60025.7
    median: 60000.5
    p95: 60025.5
    p99: 60025.7
  Codes:
    504: 20

Report @ 12:10:37(-0300) 2020-11-08
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59999.9
    max: 60003.3
    median: 60000.4
    p95: 60002.1
    p99: 60003.3
  Codes:
    504: 20

Report @ 12:10:47(-0300) 2020-11-08
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.1
    max: 60020.7
    median: 60000.5
    p95: 60010.9
    p99: 60020.7
  Codes:
    504: 20

Report @ 12:10:57(-0300) 2020-11-08
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.2
    max: 60016.7
    median: 60000.5
    p95: 60009
    p99: 60016.7
  Codes:
    504: 20

Report @ 12:11:07(-0300) 2020-11-08
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.2
    max: 60003.9
    median: 60000.5
    p95: 60003.8
    p99: 60003.9
  Codes:
    504: 20

Report @ 12:11:17(-0300) 2020-11-08
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.2
    max: 60001.2
    median: 60000.5
    p95: 60001.1
    p99: 60001.2
  Codes:
    504: 20

Report @ 12:11:27(-0300) 2020-11-08
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.1
    max: 60009.7
    median: 60000.5
    p95: 60006.9
    p99: 60009.7
  Codes:
    504: 20

Report @ 12:11:37(-0300) 2020-11-08
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59997.8
    max: 60001.9
    median: 60000.6
    p95: 60001.7
    p99: 60001.9
  Codes:
    504: 20

Report @ 12:11:47(-0300) 2020-11-08
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.3
    max: 60001.3
    median: 60000.6
    p95: 60001.3
    p99: 60001.3
  Codes:
    504: 20

Report @ 12:11:57(-0300) 2020-11-08
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.3
    max: 60004.2
    median: 60000.6
    p95: 60004
    p99: 60004.2
  Codes:
    504: 20

Report @ 12:12:07(-0300) 2020-11-08
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.3
    max: 60036.6
    median: 60000.6
    p95: 60020.2
    p99: 60036.6
  Codes:
    504: 20

Report @ 12:12:17(-0300) 2020-11-08
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 60000
    max: 60003.7
    median: 60000.6
    p95: 60002.3
    p99: 60003.7
  Codes:
    504: 20

Report @ 12:12:27(-0300) 2020-11-08
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59999.5
    max: 60003.8
    median: 60000.6
    p95: 60003.8
    p99: 60003.8
  Codes:
    504: 20

Report @ 12:12:37(-0300) 2020-11-08
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998
    max: 60003.7
    median: 60000.7
    p95: 60003.7
    p99: 60003.7
  Codes:
    504: 20

Report @ 12:12:47(-0300) 2020-11-08
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.4
    max: 60003.6
    median: 60000.5
    p95: 60002.4
    p99: 60003.6
  Codes:
    504: 20

Report @ 12:12:57(-0300) 2020-11-08
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.2
    max: 60003.7
    median: 60000.5
    p95: 60003.3
    p99: 60003.7
  Codes:
    504: 20

Report @ 12:13:07(-0300) 2020-11-08
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.1
    max: 60003.8
    median: 60000.6
    p95: 60003.8
    p99: 60003.8
  Codes:
    504: 20

Report @ 12:13:17(-0300) 2020-11-08
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.7
    max: 60001.6
    median: 60000.5
    p95: 60001.1
    p99: 60001.6
  Codes:
    504: 20

Report @ 12:13:27(-0300) 2020-11-08
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59999.3
    max: 60001.2
    median: 60000.5
    p95: 60000.9
    p99: 60001.2
  Codes:
    504: 20

Report @ 12:13:37(-0300) 2020-11-08
Elapsed time: 4 minutes, 50 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59999.5
    max: 60003.7
    median: 60000.5
    p95: 60003.7
    p99: 60003.7
  Codes:
    504: 20

Report @ 12:13:47(-0300) 2020-11-08
Elapsed time: 5 minutes, 0 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59998.2
    max: 60004.1
    median: 60000.6
    p95: 60003.9
    p99: 60004.1
  Codes:
    504: 20

Report @ 12:13:57(-0300) 2020-11-08
Elapsed time: 5 minutes, 10 seconds
  Scenarios launched:  20
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 2.01
  Response time (msec):
    min: 59999.7
    max: 60003.6
    median: 60000.5
    p95: 60003.6
    p99: 60003.6
  Codes:
    504: 20

Started phase 2 (PlainZero2), duration: 10s @ 12:13:57(-0300) 2020-11-08
Report @ 12:14:07(-0300) 2020-11-08
Elapsed time: 5 minutes, 20 seconds
  Scenarios launched:  10
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 1
  Response time (msec):
    min: 59997.5
    max: 60004.4
    median: 59999
    p95: 60003.7
    p99: 60004.4
  Codes:
    504: 20

Report @ 12:14:17(-0300) 2020-11-08
Elapsed time: 5 minutes, 30 seconds
  Scenarios launched:  1
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.1
  Response time (msec):
    min: 59998.4
    max: 60001.8
    median: 60000.4
    p95: 60001.8
    p99: 60001.8
  Codes:
    504: 20

Report @ 12:14:27(-0300) 2020-11-08
Elapsed time: 5 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 59998.8
    max: 60002.3
    median: 60000.7
    p95: 60002.3
    p99: 60002.3
  Codes:
    504: 20

Report @ 12:14:37(-0300) 2020-11-08
Elapsed time: 5 minutes, 50 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 59998.3
    max: 60002.1
    median: 60000.1
    p95: 60002
    p99: 60002.1
  Codes:
    504: 20

Report @ 12:14:47(-0300) 2020-11-08
Elapsed time: 6 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 59998.6
    max: 60002.5
    median: 60000.8
    p95: 60002.2
    p99: 60002.5
  Codes:
    504: 20

Report @ 12:14:57(-0300) 2020-11-08
Elapsed time: 6 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 59998.3
    max: 60002.4
    median: 60000.1
    p95: 60002.2
    p99: 60002.4
  Codes:
    504: 20

Report @ 12:15:07(-0300) 2020-11-08
Elapsed time: 6 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  10
  Mean response/sec: NaN
  Response time (msec):
    min: 59999.6
    max: 60004
    median: 60002.1
    p95: 60004
    p99: 60004
  Codes:
    504: 10

Report @ 12:15:07(-0300) 2020-11-08
Elapsed time: 6 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: NaN
  Response time (msec):
    min: 60003.1
    max: 60003.1
    median: 60003.1
    p95: 60003.1
    p99: 60003.1
  Codes:
    504: 1

All virtual users finished
Summary report @ 12:15:07(-0300) 2020-11-08
  Scenarios launched:  610
  Scenarios completed: 610
  Requests completed:  610
  Mean response/sec: 1.65
  Response time (msec):
    min: 4134.7
    max: 60040.7
    median: 60000.5
    p95: 60003.7
    p99: 60012.5
  Scenario counts:
    Heavy (/heavy): 610 (100%)
  Codes:
    200: 13
    504: 597